<a href="https://colab.research.google.com/github/cesarrivera52/Concentracion2/blob/main/Valores%20Nulos/Act2.2/2_2_ValoresNulos_Concentracion.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Importamos librerias requeridas

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
data = pd.read_csv('Base_Socio_Formador_Con_Nulos.csv', encoding="latin")

In [ ]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4359 entries, 0 to 4358
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   fecha             4347 non-null   object
 1   precio            4328 non-null   object
 2   año_hecho         4349 non-null   object
 3   año_renovado      4339 non-null   float64
 4   metros_cuadrados  4333 non-null   float64
 5   pisos             4340 non-null   float64
 6   habitaciones      4348 non-null   float64
 7   baños             4346 non-null   float64
 8   calle             4333 non-null   object
 9   codigo_zip        4339 non-null   float64
 10  estado            4353 non-null   object
 11  ciudad            4340 non-null   object
dtypes: float64(6), object(6)
memory usage: 408.8+ KB

In [ ]:
data.isnull().sum()

fecha               12
precio              31
año_hecho           10
año_renovado        20
metros_cuadrados    26
pisos               19
habitaciones        11
baños               13
calle               26
codigo_zip          20
estado               6
ciudad              19
dtype: int64

In [ ]:
data.head()

,fecha,precio,año_hecho,año_renovado,metros_cuadrados,pisos,habitaciones,baños,calle,codigo_zip,estado,ciudad
0,24/06/2019,"$260,070",01/01/1982,2016.0,762.0,1.0,4.0,2.0,2400 WALNUT RIDGE ST,75229.0,TX,DALLAS
1,18/07/2019,"$456,280",01/01/1982,2016.0,866.0,2.0,4.0,2.0,10400 BIG THICKET DR,75217.0,TX,DALLAS
2,31/07/2019,"$237,820",01/01/1982,2016.0,814.0,1.0,5.0,3.0,9200 DARTWOOD LN,75225.0,TX,DALLAS
3,14/08/2019,"$231,000",01/01/1980,2016.0,680.0,1.0,4.0,2.0,4800 SIMCOE ST,75228.0,TX,DALLAS
4,31/07/2019,"$1,410,820",01/01/1980,2016.0,1018.0,2.0,4.0,2.0,6926 STEFANI DR,75225.0,TX,DALLAS

En la **primer sección de valores nulos a llenar**, se decidió utilizar la función .fillna con un valor, en este caso los valores nulos se llenan con la fecha del primero de enero del 2030, esto con la finalidad de poder identificar en futuros estudios los valores que presentaban valores nulos.

In [ ]:
data['fecha']=data['fecha'].fillna(1/1/2030)

In [ ]:
data.isnull().sum()

fecha                0
precio              31
año_hecho           10
año_renovado        20
metros_cuadrados    26
pisos               19
habitaciones        11
baños               13
calle               26
codigo_zip          20
estado               6
ciudad              19
dtype: int64

En la **segunda sección de valores nulos a llenar**, se decidió utilizar la función .fillna con un valor de $0, con la finalidad de poder identificar en futuros estudios los valores que presentaban valores nulos.

In [ ]:
data['precio']=data['precio'].fillna('$0')

In [ ]:
data.isnull().sum()

fecha                0
precio               0
año_hecho           10
año_renovado        20
metros_cuadrados    26
pisos               19
habitaciones        11
baños               13
calle               26
codigo_zip          20
estado               6
ciudad              19
dtype: int64

En la **tercer sección de valores nulos a llenar**, se decidió utilizar la función .fillna con un valor de 1/1/1500, con la finalidad de poder identificar en futuros estudios los valores que presentaban valores nulos.

In [ ]:
data['año_hecho']=data['año_hecho'].fillna(1/1/1500)

In [ ]:
data.isnull().sum()

fecha                0
precio               0
año_hecho            0
año_renovado        20
metros_cuadrados    26
pisos               19
habitaciones        11
baños               13
calle               26
codigo_zip          20
estado               6
ciudad              19
dtype: int64

En la **cuarta sección de valores nulos a llenar**, se decidió utilizar la función .fillna con un valor de 0.5, con la finalidad de poder identificar en futuros estudios los valores que presentaban valores nulos.

In [ ]:
data['año_renovado']=data['año_renovado'].fillna(0.5)

In [ ]:
data.isnull().sum()

fecha                0
precio               0
año_hecho            0
año_renovado         0
metros_cuadrados    26
pisos               19
habitaciones        11
baños               13
calle               26
codigo_zip          20
estado               6
ciudad              19
dtype: int64

En la **quinta sección de valores nulos a llenar**, se decidió utilizar la función .fillna con un valor de 0, con la finalidad de poder identificar en futuros estudios los valores que presentaban valores nulos.

In [ ]:
data['metros_cuadrados']=data['metros_cuadrados'].fillna(0)

In [ ]:
data.isnull().sum()

fecha                0
precio               0
año_hecho            0
año_renovado         0
metros_cuadrados     0
pisos               19
habitaciones        11
baños               13
calle               26
codigo_zip          20
estado               6
ciudad              19
dtype: int64

En la **sexta sección de valores nulos a llenar**, se decidió utilizar la función .fillna con un valor de 0, con la finalidad de poder identificar en futuros estudios los valores que presentaban valores nulos.

In [ ]:
data['pisos']=data['pisos'].fillna(0)

In [ ]:
data.isnull().sum()

fecha                0
precio               0
año_hecho            0
año_renovado         0
metros_cuadrados     0
pisos                0
habitaciones        11
baños               13
calle               26
codigo_zip          20
estado               6
ciudad              19
dtype: int64

En la **septima sección de valores nulos a llenar**, se decidió utilizar la función .fillna con un valor de 0.5, con la finalidad de poder identificar en futuros estudios los valores que presentaban valores nulos.

In [41]:
data['habitaciones']=data['habitaciones'].fillna(0.5)

In [42]:
data.isnull().sum()

fecha                0
precio               0
año_hecho            0
año_renovado         0
metros_cuadrados     0
pisos                0
habitaciones         0
baños               13
calle               26
codigo_zip          20
estado               6
ciudad              19
dtype: int64

En la **octava sección de valores nulos a llenar**, se decidió utilizar la función .fillna con un valor de 0.5, con la finalidad de poder identificar en futuros estudios los valores que presentaban valores nulos.

In [44]:
data['baños']=data['baños'].fillna(0.5)

In [45]:
data.isnull().sum()

fecha                0
precio               0
año_hecho            0
año_renovado         0
metros_cuadrados     0
pisos                0
habitaciones         0
baños                0
calle               26
codigo_zip          20
estado               6
ciudad              19
dtype: int64

En la **novena sección de valores nulos a llenar**, se decidió utilizar la función .fillna con un valor de VALOR NULO, con la finalidad de poder identificar en futuros estudios los valores que presentaban valores nulos.

In [46]:
data['calle']=data['calle'].fillna('VALOR NULO')

In [47]:
data.isnull().sum()

fecha                0
precio               0
año_hecho            0
año_renovado         0
metros_cuadrados     0
pisos                0
habitaciones         0
baños                0
calle                0
codigo_zip          20
estado               6
ciudad              19
dtype: int64

En la **decima sección de valores nulos a llenar**, se decidió utilizar la función .fillna con un valor de 12345, con la finalidad de poder identificar en futuros estudios los valores que presentaban valores nulos.

In [50]:
data['codigo_zip']=data['codigo_zip'].fillna(12345)

In [51]:
data.isnull().sum()

fecha                0
precio               0
año_hecho            0
año_renovado         0
metros_cuadrados     0
pisos                0
habitaciones         0
baños                0
calle                0
codigo_zip           0
estado               6
ciudad              19
dtype: int64

En la **onceava sección de valores nulos a llenar**, se decidió utilizar la función .fillna con un valor de NULO, con la finalidad de poder identificar en futuros estudios los valores que presentaban valores nulos.

In [53]:
data['estado']=data['estado'].fillna('NULO')

In [54]:
data.isnull().sum()

fecha                0
precio               0
año_hecho            0
año_renovado         0
metros_cuadrados     0
pisos                0
habitaciones         0
baños                0
calle                0
codigo_zip           0
estado               0
ciudad              19
dtype: int64

En la **doceava sección de valores nulos a llenar**, se decidió utilizar la función .fillna con un valor de NULO, con la finalidad de poder identificar en futuros estudios los valores que presentaban valores nulos.

In [55]:
data['ciudad']=data['ciudad'].fillna('NULO')

In [56]:
data.isnull().sum()

fecha               0
precio              0
año_hecho           0
año_renovado        0
metros_cuadrados    0
pisos               0
habitaciones        0
baños               0
calle               0
codigo_zip          0
estado              0
ciudad              0
dtype: int64

In [57]:
data.to_csv('BASE_SF_LIMPIA.csv')